
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/terraform-for-container-operation/actions/runs/5693747514)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075058cf3c293747f]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d451342d3cfc463c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0aadae0bd723083b6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0393c7a160030dccf]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08ba86b00c36d4b2a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0110bf1fc9c4088c2]
aws_security_group.ecs: Refreshing state... [id=sg-0ac74d3a206d70d04]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c3f487829a2e1587]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ca36752b1b4ca25b]
aws_security_group.alb: Refreshing state... [id=sg-0302e3d2b024b00f0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-045e7a4287d60f218]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0159c63a097a933ae]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3adca757c7a29b2]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ad7a27af85265202]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-020770d2bf0cce94b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0110bf1fc9c4088c21080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0854cdc54210a818e]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-586569237]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-094be487cdd8dc310]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03ad33c2a0995ef02]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-047bd52bbcf806376]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fd749b24ca4fea4b]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03c7ba16c4f55b0a1]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-082ec01efead41866]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ad7a27af852652021080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3adca757c7a29b21080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-for-api-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0302e3d2b024b00f0",
        ]
      + subnets                                     = [
          + "subnet-0159c63a097a933ae",
          + "subnet-045e7a4287d60f218",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-for-api-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-075058cf3c293747f"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/go-for-api-target-group/7beb819d5c6a8417]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Creation complete after 2m55s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/go-for-api-alb/ca621acff5f672b2]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/go-for-api-alb/ca621acff5f672b2/6a595fa8f421ceb8]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/go-for-api-alb/ca621acff5f672b2/6a595fa8f421ceb8/2c11cb06da83f8ae]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"eb75da48a46b40068b7f2998bf6928a010006c9f","Vars":{},"WorkflowName":"Terraform"} -->